ucsbieee/ArduinoCore-SAM3A4C/boards.txt
TC_controller.name=Tesla Coil Controller
TC_controller.vid.0=0x2341
TC_controller.pid.0=0x1337
TC_controller.vid.1=0x2A03
TC_controller.pid.1=0x1337
TC_controller.upload.tool=bossac
TC_controller.upload.protocol=sam-ba
TC_controller.upload.maximum_size=262144
TC_controller.upload.use_1200bps_touch=true
TC_controller.upload.wait_for_upload_port=true
TC_controller.upload.native_usb=true
TC_controller.build.mcu=cortex-m3
TC_controller.build.f_cpu=84000000L
TC_controller.build.usb_manufacturer="UCSB IEEE"
TC_controller.build.usb_product="Tesla Coil Controller"
TC_controller.build.board=SAM_DUE
TC_controller.build.core=arduino
TC_controller.build.extra_flags=-D__SAM3A4C__ -mthumb {build.usb_flags}
TC_controller.build.ldscript=linker_scripts/gcc/flash.ld
TC_controller.build.variant=arduino_due_x
TC_controller.build.variant_system_lib=libsam_sam3a4c_gcc_rel.a
TC_controller.build.vid=0x2341
TC_controller.build.pid=0x1337
